masarray/arstack61850/embedded/esp32p4_smv_injector/main/ptp_lab_task.cpp
// SPDX-License-Identifier: GPL-3.0-or-later

#include "ptp_lab_task.hpp"

#include "ariec61850/time_sync/ptp.hpp"
#include "ariec61850/time_sync/ptp_runtime.hpp"

#include "esp_err.h"
#include "esp_eth.h"
#include "esp_eth_driver.h"
#include "esp_eth_mac.h"
#include "esp_idf_version.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "sdkconfig.h"
#include "soc/soc_caps.h"

#if ESP_IDF_VERSION_MAJOR < 6
#include "esp_eth_mac_esp.h"
#endif

#include <array>
#include <atomic>
#include <chrono>
#include <cstdint>
#include <cstdlib>
#include <ctime>
#include <limits>
#include <optional>
#include <span>
#include <string>
#include <utility>
#include <vector>

namespace ar::esp32p4::smv {
namespace {

using ar::iec61850::time_sync::PtpClockAccuracy;
using ar::iec61850::time_sync::PtpFrame;
using ar::iec61850::time_sync::PtpMessageType;
using ar::iec61850::time_sync::PtpPortIdentity;
using ar::iec61850::time_sync::PtpPublisherOptions;
using ar::iec61850::time_sync::PtpPublisherRuntime;
using ar::iec61850::time_sync::PtpTimeSource;
using ar::iec61850::time_sync::PtpTimestamp;
using ar::iec61850::time_sync::format_ptp_clock_identity;
using ar::iec61850::time_sync::ptp_clock_identity_from_mac;
using ar::iec61850::time_sync::try_parse_ptp_clock_identity;

constexpr char kTag[] = "ar_ptp_lab";
constexpr TickType_t kStartupDelay = pdMS_TO_TICKS(500);
constexpr UBaseType_t kPdelayQueueDepth = 8U;

struct PdelayRequestEvent final {
    PtpPortIdentity requesting_port_identity{};
    PtpTimestamp receive_timestamp{};
    std::uint16_t sequence_id{};
    std::int8_t log_message_interval{};
};

struct PtpLabContext final {
    esp_eth_handle_t eth_handle{};
    std::array<std::uint8_t, 6> source_mac{};
    QueueHandle_t pdelay_queue{};
    TaskHandle_t task_handle{};
    std::optional<PtpPublisherRuntime> runtime;
};

PtpLabContext g_ptp_context{};
std::atomic_bool g_ptp_started{false};
std::atomic_bool g_stop_requested{false};

[[nodiscard]] std::optional<std::uint16_t> ptp_vlan_id() noexcept {
#if defined(CONFIG_AR_PTP_VLAN) && CONFIG_AR_PTP_VLAN
    return static_cast<std::uint16_t>(CONFIG_AR_PTP_VLAN_ID);
#else
    return std::nullopt;
#endif
}

[[nodiscard]] std::uint8_t ptp_vlan_priority() noexcept {
#if defined(CONFIG_AR_PTP_VLAN) && CONFIG_AR_PTP_VLAN
    return static_cast<std::uint8_t>(CONFIG_AR_PTP_VLAN_PRIORITY);
#else
    return 0U;
#endif
}

[[nodiscard]] std::optional<PtpPublisherOptions> make_runtime_options(
    const std::array<std::uint8_t, 6>& source_mac) {
    PtpPublisherOptions options;
    options.transport_specific = static_cast<std::uint8_t>(CONFIG_AR_PTP_TRANSPORT_SPECIFIC);
    options.domain_number = static_cast<std::uint8_t>(CONFIG_AR_PTP_DOMAIN);
    options.source_mac = source_mac;
    options.vlan_id = ptp_vlan_id();
    options.vlan_priority = ptp_vlan_priority();
    options.clock_identity = ptp_clock_identity_from_mac(source_mac);
    options.port_number = static_cast<std::uint16_t>(CONFIG_AR_PTP_PORT_NUMBER);
    options.announce_interval = std::chrono::milliseconds{CONFIG_AR_PTP_ANNOUNCE_INTERVAL_MS};
    options.sync_interval = std::chrono::milliseconds{CONFIG_AR_PTP_SYNC_INTERVAL_MS};
    options.follow_up_delay = std::chrono::milliseconds::zero();
    // ESP32-P4 intentionally stays two-step so the exact EMAC egress timestamp
    // can be placed in Follow_Up instead of approximating a one-step timestamp.
    options.two_step_clock = true;
#if defined(CONFIG_AR_PTP_RESPOND_PDELAY) && CONFIG_AR_PTP_RESPOND_PDELAY
    options.respond_to_peer_delay = true;
#else
    options.respond_to_peer_delay = false;
#endif
    options.priority1 = static_cast<std::uint8_t>(CONFIG_AR_PTP_PRIORITY1);
    options.priority2 = static_cast<std::uint8_t>(CONFIG_AR_PTP_PRIORITY2);
    options.clock_class = static_cast<std::uint8_t>(CONFIG_AR_PTP_CLOCK_CLASS);
    options.clock_accuracy = static_cast<PtpClockAccuracy>(
        static_cast<std::uint8_t>(CONFIG_AR_PTP_CLOCK_ACCURACY));
    options.offset_scaled_log_variance =
        static_cast<std::uint16_t>(CONFIG_AR_PTP_OFFSET_SCALED_LOG_VARIANCE);
    options.time_source = static_cast<PtpTimeSource>(
        static_cast<std::uint8_t>(CONFIG_AR_PTP_TIME_SOURCE));
    options.current_utc_offset = static_cast<std::int16_t>(CONFIG_AR_PTP_CURRENT_UTC_OFFSET);

    const std::string configured_identity{CONFIG_AR_PTP_CLOCK_IDENTITY};
    if (!configured_identity.empty()) {
        ar::iec61850::time_sync::PtpClockIdentity parsed{};
        if (!try_parse_ptp_clock_identity(configured_identity, parsed)) {
            ESP_LOGE(kTag,
                     "Invalid CONFIG_AR_PTP_CLOCK_IDENTITY '%s'; expected 8 hex bytes",
                     configured_identity.c_str());
            return std::nullopt;
        }
        options.clock_identity = parsed;
    }

    std::string validation_error;
    if (!PtpPublisherRuntime::validate_options(options, validation_error)) {
        ESP_LOGE(kTag, "Invalid PTP runtime profile: %s", validation_error.c_str());
        return std::nullopt;
    }
    return options;
}

#if defined(SOC_EMAC_IEEE1588V2_SUPPORTED) && SOC_EMAC_IEEE1588V2_SUPPORTED && ESP_IDF_VERSION_MAJOR < 6

[[nodiscard]] bool valid_hw_timestamp(const eth_mac_time_t& timestamp) noexcept {
    return timestamp.nanoseconds < 1'000'000'000U &&
           (timestamp.seconds != 0U || timestamp.nanoseconds != 0U);
}

[[nodiscard]] PtpTimestamp to_ptp_timestamp(const eth_mac_time_t& timestamp) noexcept {
    return {
        static_cast<std::uint64_t>(timestamp.seconds),
        timestamp.nanoseconds,
    };
}

[[nodiscard]] bool enable_hardware_ptp(const esp_eth_handle_t eth_handle) noexcept {
    bool enable = true;
    const auto result = esp_eth_ioctl(
        eth_handle,
        static_cast<esp_eth_io_cmd_t>(ETH_MAC_ESP_CMD_PTP_ENABLE),
        &enable);
    if (result != ESP_OK) {
        ESP_LOGE(kTag, "Failed to enable ESP32-P4 IEEE1588 hardware clock: %s",
                 esp_err_to_name(result));
        return false;
    }
    return true;
}

void seed_hardware_clock(const esp_eth_handle_t eth_handle) noexcept {
    eth_mac_time_t initial_time{};
    const std::time_t system_time = std::time(nullptr);
    if (system_time > 0 &&
        static_cast<std::uint64_t>(system_time) <= std::numeric_limits<std::uint32_t>::max()) {
        initial_time.seconds = static_cast<std::uint32_t>(system_time);
    }
    const auto result = esp_eth_ioctl(
        eth_handle,
        static_cast<esp_eth_io_cmd_t>(ETH_MAC_ESP_CMD_S_PTP_TIME),
        &initial_time);
    if (result != ESP_OK) {
        ESP_LOGW(kTag, "Unable to seed hardware PTP time: %s", esp_err_to_name(result));
    }
}

[[nodiscard]] PtpTimestamp hardware_time(const esp_eth_handle_t eth_handle) noexcept {
    eth_mac_time_t timestamp{};
    const auto result = esp_eth_ioctl(
        eth_handle,
        static_cast<esp_eth_io_cmd_t>(ETH_MAC_ESP_CMD_G_PTP_TIME),
        &timestamp);
    if (result != ESP_OK || timestamp.nanoseconds >= 1'000'000'000U) {
        return {};
    }
    return to_ptp_timestamp(timestamp);
}

[[nodiscard]] bool send_frame(
    const esp_eth_handle_t eth_handle,
    std::vector<std::uint8_t>& frame) noexcept {
    if (frame.empty()) return false;
    return esp_eth_transmit(eth_handle, frame.data(), frame.size()) == ESP_OK;
}

[[nodiscard]] bool transmit_with_hw_timestamp(
    const esp_eth_handle_t eth_handle,
    std::vector<std::uint8_t>& frame,
    PtpTimestamp& timestamp) noexcept {
    if (frame.empty()) return false;
    eth_mac_time_t tx_timestamp{};
    const auto result = esp_eth_transmit_ctrl_vargs(
        eth_handle,
        &tx_timestamp,
        2U,
        frame.data(),
        frame.size());
    if (result != ESP_OK || !valid_hw_timestamp(tx_timestamp)) {
        return false;
    }
    timestamp = to_ptp_timestamp(tx_timestamp);
    return true;
}

[[nodiscard]] bool send_sync_follow_up(PtpLabContext& context) {
    if (!context.runtime.has_value()) return false;
    auto& runtime = *context.runtime;

    // Two-step Sync intentionally carries zero originTimestamp. The exact MAC
    // egress timestamp returned by the ESP32-P4 descriptor becomes Follow_Up.
    auto sync = runtime.prepare_sync(PtpTimestamp{});
    if (!sync.has_value()) return false;

    PtpTimestamp tx_timestamp;
    if (!transmit_with_hw_timestamp(
            context.eth_handle,
            sync->ethernet_frame,
            tx_timestamp)) {
        return false;
    }
    runtime.record_sent(PtpMessageType::sync);

    auto follow_up = runtime.prepare_follow_up(sync->sequence_id, tx_timestamp);
    if (!follow_up.has_value() ||
        !send_frame(context.eth_handle, follow_up->ethernet_frame)) {
        return false;
    }
    runtime.record_sent(PtpMessageType::follow_up);
    return true;
}

[[nodiscard]] bool send_announce(PtpLabContext& context) {
    if (!context.runtime.has_value()) return false;
    auto& runtime = *context.runtime;
    auto announce = runtime.prepare_announce(hardware_time(context.eth_handle));
    if (!announce.has_value() ||
        !send_frame(context.eth_handle, announce->ethernet_frame)) {
        return false;
    }
    runtime.record_sent(PtpMessageType::announce);
    return true;
}

[[nodiscard]] bool send_pdelay_response(
    PtpLabContext& context,
    const PdelayRequestEvent& request) {
    if (!context.runtime.has_value()) return false;
    auto& runtime = *context.runtime;

    // t2 comes from the EMAC RX descriptor captured with Pdelay_Req.
    auto response = runtime.prepare_pdelay_response(
        request.requesting_port_identity,
        request.sequence_id,
        request.log_message_interval,
        request.receive_timestamp);
    if (!response.has_value()) return false;

    PtpTimestamp response_tx_timestamp;
    if (!transmit_with_hw_timestamp(
            context.eth_handle,
            response->ethernet_frame,
            response_tx_timestamp)) {
        return false;
    }
    runtime.record_sent(PtpMessageType::pdelay_resp);

    // t3 is the exact Pdelay_Resp EMAC transmit timestamp.
    auto follow_up = runtime.prepare_pdelay_response_follow_up(
        request.requesting_port_identity,
        request.sequence_id,
        request.log_message_interval,
        response_tx_timestamp);
    if (!follow_up.has_value() ||
        !send_frame(context.eth_handle, follow_up->ethernet_frame)) {
        return false;
    }
    runtime.record_sent(PtpMessageType::pdelay_resp_follow_up);

    if (runtime.status().peer_delay_responses_sent == 2U) {
        ESP_LOGI(kTag, "First hardware-timestamped Pdelay exchange completed");
    }
    return true;
}

esp_err_t ptp_input_info(
    esp_eth_handle_t,
    std::uint8_t* buffer,
    const std::uint32_t length,
    void* priv,
    void* info) {
    auto* context = static_cast<PtpLabContext*>(priv);
    if (buffer == nullptr) return ESP_OK;

    if (g_ptp_started.load(std::memory_order_acquire) &&
        context != nullptr &&
        context->runtime.has_value() &&
        context->runtime->options().respond_to_peer_delay &&
        context->pdelay_queue != nullptr &&
        info != nullptr) {
        PtpFrame frame;
        const auto& profile = context->runtime->options();
        if (ar::iec61850::time_sync::PtpCodec::try_parse_ethernet_frame(
                std::span<const std::uint8_t>{buffer, length},
                frame) &&
            frame.peer_delay_multicast &&
            frame.header.message_type == PtpMessageType::pdelay_req &&
            frame.header.domain_number == profile.domain_number &&
            frame.header.transport_specific == profile.transport_specific) {
            const auto& rx_timestamp = *static_cast<const eth_mac_time_t*>(info);
            if (valid_hw_timestamp(rx_timestamp)) {
                const PdelayRequestEvent event{
                    frame.header.source_port_identity,
                    to_ptp_timestamp(rx_timestamp),
                    frame.header.sequence_id,
                    frame.header.log_message_interval,
                };
                if (xQueueSend(context->pdelay_queue, &event, 0U) == pdTRUE &&
                    context->task_handle != nullptr) {
                    xTaskNotifyGive(context->task_handle);
                }
            }
        }
    }

    // Standalone raw-L2 injector owns this RX buffer while PTP adapter is active.
    std::free(buffer);
    return ESP_OK;
}

void finish_runtime(PtpLabContext& context) {
    if (context.runtime.has_value()) {
        context.runtime->stop();
        const auto status = context.runtime->status();
        ESP_LOGI(kTag,
                 "PTP stopped: Announce=%llu Sync=%llu FollowUp=%llu PdelayFrames=%llu%s%s",
                 static_cast<unsigned long long>(status.announce_sent),
                 static_cast<unsigned long long>(status.sync_sent),
                 static_cast<unsigned long long>(status.follow_up_sent),
                 static_cast<unsigned long long>(status.peer_delay_responses_sent),
                 status.last_error.empty() ? "" : " lastError=",
                 status.last_error.empty() ? "" : status.last_error.c_str());
    }
    context.task_handle = nullptr;
    g_ptp_started.store(false, std::memory_order_release);
}

void ptp_lab_task(void* argument) {
    auto& context = *static_cast<PtpLabContext*>(argument);
    vTaskDelay(kStartupDelay);

    if (!enable_hardware_ptp(context.eth_handle)) {
        ESP_LOGE(kTag, "PTP lab broadcaster stopped: hardware timestamp clock unavailable");
        finish_runtime(context);
        vTaskDelete(nullptr);
        return;
    }
    seed_hardware_clock(context.eth_handle);

    const auto mac_result = esp_eth_ioctl(
        context.eth_handle,
        ETH_CMD_G_MAC_ADDR,
        context.source_mac.data());
    if (mac_result != ESP_OK) {
        ESP_LOGE(kTag, "PTP lab broadcaster stopped: MAC address unavailable: %s",
                 esp_err_to_name(mac_result));
        finish_runtime(context);
        vTaskDelete(nullptr);
        return;
    }

    auto profile = make_runtime_options(context.source_mac);
    if (!profile.has_value()) {
        finish_runtime(context);
        vTaskDelete(nullptr);
        return;
    }

    context.runtime.emplace(std::move(*profile));
    if (!context.runtime->start()) {
        ESP_LOGE(kTag,
                 "PTP runtime rejected profile: %s",
                 context.runtime->status().last_error.c_str());
        finish_runtime(context);
        vTaskDelete(nullptr);
        return;
    }

    bool pdelay_enabled = false;
    if (context.runtime->options().respond_to_peer_delay &&
        context.pdelay_queue != nullptr) {
        const auto input_result = esp_eth_update_input_path_info(
            context.eth_handle,
            &ptp_input_info,
            &context);
        if (input_result == ESP_OK) {
            pdelay_enabled = true;
        } else {
            ESP_LOGW(kTag,
                     "Hardware RX timestamp path unavailable; Pdelay responder disabled: %s",
                     esp_err_to_name(input_result));
        }
    }

    const auto& options = context.runtime->options();
    const auto clock_identity = format_ptp_clock_identity(options.clock_identity);
    ESP_LOGW(kTag,
             "PTP LAB TX enabled: troubleshooting/interoperability helper only; not a GPS-backed or certified grandmaster");
    ESP_LOGI(kTag,
             "PTP runtime domain=%u transportSpecific=0x%X clockIdentity=%s port=%u VLAN=%s Announce=%lld ms Sync=%lld ms HW Sync TX=enabled HW Pdelay=%s",
             static_cast<unsigned>(options.domain_number),
             static_cast<unsigned>(options.transport_specific),
             clock_identity.c_str(),
             static_cast<unsigned>(options.port_number),
             options.vlan_id.has_value() ? "tagged" : "untagged",
             static_cast<long long>(options.announce_interval.count()),
             static_cast<long long>(options.sync_interval.count()),
             pdelay_enabled ? "enabled" : "disabled");

    std::uint32_t consecutive_failures = 0U;
    while (!g_stop_requested.load(std::memory_order_acquire)) {
        bool attempted = false;
        bool success = true;

        PdelayRequestEvent pdelay_request;
        while (context.pdelay_queue != nullptr &&
               xQueueReceive(context.pdelay_queue, &pdelay_request, 0U) == pdTRUE) {
            attempted = true;
            success = send_pdelay_response(context, pdelay_request) && success;
        }

        const auto due = context.runtime->poll_due();
        if (due.announce) {
            attempted = true;
            success = send_announce(context) && success;
        }
        if (due.sync) {
            attempted = true;
            success = send_sync_follow_up(context) && success;
        }

        if (attempted) {
            if (success) {
                consecutive_failures = 0U;
                context.runtime->clear_error();
            } else {
                context.runtime->record_error("Ethernet transmit or hardware timestamp failure");
                ++consecutive_failures;
                if (consecutive_failures == 1U || (consecutive_failures % 16U) == 0U) {
                    ESP_LOGW(kTag,
                             "PTP TX failed (%lu consecutive); Ethernet link/driver may not be ready",
                             static_cast<unsigned long>(consecutive_failures));
                }
            }
        }

        // Pdelay RX or stop requests wake immediately; timeout only services due cadence.
        ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(5));
    }

    finish_runtime(context);
    vTaskDelete(nullptr);
}

#else

void ptp_lab_task(void*) {
    ESP_LOGE(kTag,
             "PTP lab broadcaster requires ESP32-P4 IEEE1588 support and the ESP-IDF 5.x EMAC timestamp adapter");
    g_ptp_started.store(false, std::memory_order_release);
    vTaskDelete(nullptr);
}

#endif

void start_ptp_lab(const esp_eth_handle_t eth_handle) {
    if (eth_handle == nullptr) {
        ESP_LOGE(kTag, "PTP lab broadcaster not started: Ethernet handle is null");
        return;
    }

    bool expected = false;
    if (!g_ptp_started.compare_exchange_strong(
            expected,
            true,
            std::memory_order_acq_rel)) {
        return;
    }

    g_stop_requested.store(false, std::memory_order_release);
    g_ptp_context.eth_handle = eth_handle;
    g_ptp_context.runtime.reset();
    g_ptp_context.task_handle = nullptr;

    if (g_ptp_context.pdelay_queue == nullptr) {
        g_ptp_context.pdelay_queue = xQueueCreate(
            kPdelayQueueDepth,
            sizeof(PdelayRequestEvent));
    } else {
        xQueueReset(g_ptp_context.pdelay_queue);
    }
    if (g_ptp_context.pdelay_queue == nullptr) {
        ESP_LOGW(kTag, "Pdelay queue allocation failed; broadcaster will run without Pdelay RX responses");
    }

    if (xTaskCreatePinnedToCore(
            &ptp_lab_task,
            "ar_ptp_lab",
            7168,
            &g_ptp_context,
            4,
            &g_ptp_context.task_handle,
            0) != pdPASS) {
        g_ptp_context.task_handle = nullptr;
        g_ptp_started.store(false, std::memory_order_release);
        ESP_LOGE(kTag, "Failed to create PTP lab task on CPU0");
    }
}

void stop_ptp_lab() noexcept {
    if (!g_ptp_started.load(std::memory_order_acquire)) return;
    g_stop_requested.store(true, std::memory_order_release);
    if (g_ptp_context.task_handle != nullptr) {
        xTaskNotifyGive(g_ptp_context.task_handle);
    }
}

[[nodiscard]] bool ptp_lab_is_running() noexcept {
    return g_ptp_started.load(std::memory_order_acquire);
}

} // namespace
} // namespace ar::esp32p4::smv

extern "C" void ar_ptp_lab_start(const esp_eth_handle_t eth_handle) {
    ar::esp32p4::smv::start_ptp_lab(eth_handle);
}

extern "C" void ar_ptp_lab_stop(void) {
    ar::esp32p4::smv::stop_ptp_lab();
}

extern "C" bool ar_ptp_lab_is_running(void) {
    return ar::esp32p4::smv::ptp_lab_is_running();
}
